import React, { Component } from 'react';
import './Delivery.css'

import { YMaps, Map, GeoObject } from 'react-yandex-maps';

import ButtonArrow from '../../commons/buttonArrow/ButtonArrow';

export default class Delivery extends Component {
	render() {
		
		return (
			<div className='delivery container'>
				<div className="delivery-title">Условия доставки</div>
				<div className="delivery-text">Зона бесплатной доставки отмечена на карте.
					В другие районы бесплатная доставка осуществляется при заказе от 10 обедов.
				</div>
				<div className="delivery-back">
					<ButtonArrow  onClick={() => this.props.history.goBack()}> Назад </ButtonArrow>
				</div>
				<div className="delivery-map">
					<YMaps>
						<Map
							state={mapState}
							width="100%"
						>
							<GeoObject
								geometry={geometry}
								properties={properties}
         			/>
						</Map>
					</YMaps>
				</div>
			</div>
		);
	}
}

const mapState = {
      "size": [360, 360],
      "center": [55.79293106456623, 37.45016893082407],
      "zoom": 11,
      "type": "yandex#map",
      "traffic": {
          "shown": false
      },
      "controls": []
    }

const geometry = {
	type:"Polygon",
  "coordinates":[  
     [  
        [  
           55.77525646986665,
           37.55365193729157
        ],
        [  
           55.778693171238956,
           37.55734150695449
        ],
        [  
           55.78575911937834,
           37.56540729178804
        ],
        [  
           55.79552751482103,
           37.54364921225921
        ],
        [  
           55.80041079003046,
           37.53259851111786
        ],
        [  
           55.80364985114381,
           37.51880122794526
        ],
        [  
           55.80732368244805,
           37.504317299264834
        ],
        [  
           55.81041716509341,
           37.48743011130707
        ],
        [  
           55.80896712585548,
           37.46361209525483
        ],
        [  
           55.80925713804132,
           37.42558910025971
        ],
        [  
           55.82225712186455,
           37.40091277732269
        ],
        [  
           55.81805314329441,
           37.39065601004975
        ],
        [  
           55.802920623315316,
           37.38585179137831
        ],
        [  
           55.789716624660024,
           37.372807826613105
        ],
        [  
           55.787504112180464,
           37.38403018913137
        ],
        [  
           55.78413069456498,
           37.392162646864534
        ],
        [  
           55.77659687877019,
           37.39892181358207
        ],
        [  
           55.772158135674744,
           37.40877088508474
        ],
        [  
           55.773041086867266,
           37.435871924971224
        ],
        [  
           55.77808440932063,
           37.45061334571707
        ],
        [  
           55.76871080513782,
           37.46415313682425
        ],
        [  
           55.76764932855777,
           37.46934052905901
        ],
        [  
           55.76774912674285,
           37.4765878578173
        ],
        [  
           55.76891341987369,
           37.4845218320833
        ],
        [  
           55.768335813892335,
           37.49245580634943
        ],
        [  
           55.760714238920144,
           37.51142438850268
        ],
        [  
           55.755027327547445,
           37.53210958442545
        ],
        [  
           55.76002459405061,
           37.53477033576829
        ],
        [  
           55.76589223376059,
           37.53708776435725
        ],
        [  
           55.77317413258978,
           37.54755910835139
        ],
        [  
           55.77525646986665,
           37.55365193729157
        ]
     ]
   ]
}

const properties = {  
  "description":"Зона бесплатной доставки",
  "fill":"#56db40",
  "fill-opacity":0.2,
  "stroke":"#1bad03",
  "stroke-width":"5",
  "stroke-opacity":0.9
}
